NetologySlow/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
</mdclass:Enum>

NetologySlow/src/CommonModules/НДСКлиентСервер/Module.bsl
//возврат суммы НДС, рассчитанная от суммы по ставке согласно требованиям.
//Чтобы обеспечить работоспособность на клиенте, для получения значений ставок НДС используйте функцию ПредопределенноеЗначение()

Функция  СуммаНДСПоСтавке(Сумма, СтавкаНДС) Экспорт   
	
	Если СтавкаНДС=ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		СуммаНДС=0;
	ИначеЕсли  СтавкаНДС=ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10")  Тогда
		СуммаНДС=Сумма*1.1-Сумма; 
	ИначеЕсли  СтавкаНДС=ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		СуммаНДС=Сумма*1.2-Сумма; 
	КонецЕсли;
	
	Возврат СуммаНДС; 
КонецФункции  

//Функция  СуммаНДСПоСтавкеОбратно(СуммаСНДС, СтавкаНДС) Экспорт   
//	
//	Если СтавкаНДС=ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
//		СуммаНДС=0;
//	ИначеЕсли  СтавкаНДС=ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10")  Тогда
//		СуммаНДС=СуммаСНДС*10/110;  
//	ИначеЕсли  СтавкаНДС=ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
//		Сумма=СуммаСНДС*20/120; 
//	КонецЕсли;
//	
//	Возврат СуммаНДС; 
//КонецФункции
